const FOLDER_NAME = "album37"

const indexData = {
    12: ["박철완", "김봉규", "박희준", "정진철", "손유식", "홍기열", "강석필", "배문수", "정현호", "황두형", "이대곤", "정하준", "김석호", "서명관", "김종민", "석기준"],
    13: ["김종태", "손세모", "윤남철", "황태영", "임문택", "박종규", "이호섭", "양종완", "조윤철", "구민국", "정문국", "강순곤", "정태영", "오광운", "서윤석", "조은재"],
    14: ["최성재", "윤영운", "박정순", "주법동", "문정태", "한낙현", "김재윤", "신대철", "안정도", "진명재", "정광우", "강수철", "이강곤", "조봉곤", "정만호", "김태웅"],
    15: ["김태공", "유상헌", "박갑동", "박황재", "황보훈", "전세양", "노태준", "손기호", "노준호", "김동만", "피귀동", "김성호", "최보근", "김근식", "정길현"],
    17: ["박용호", "주붕수", "원재상", "박홍관", "기창현", "전진한", "한선영", "민상기", "강형수", "심강섭", "송승훈", "진기홍", "최호윤", "양군식", "설창덕"],
    18: ["김정호", "김일호", "김판근", "정두보", "노규환", "장재환", "박봉준", "이장우", "송진성", "문태주", "안경만", "김기중", "김용삼", "오형근", "김동배", "박만우"],
    19: ["정기용", "권융", "류찬용", "이영진", "조현식", "김승탁", "윤명술", "이진원", "송명근", "김동민", "정의주", "정병태", "추민호", "손이호", "윤석호", "김정규"],
    20: ["강우원", "이규헌", "허수원", "엄기호", "김봉수", "이평언", "한석영", "문중현", "박용수", "윤태원", "이용구", "임상희", "최철홍", "손점식", "이영춘", "고형일"],
    22: ["장보석", "이진춘", "김기봉", "박종경", "구송옥", "윤재문", "정상근", "이성재", "김형만", "이창업", "고복성", "이재신", "김기문"],
    23: ["서동원", "하기주", "황인규", "옥희석", "정한수", "김무진", "이재호", "송주헌", "강상승", "서재홍", "권순득", "길종수", "추대한", "주홍"],
    24: ["최석림", "송승호", "김양호", "김형철", "한용섭", "김희수", "박충실", "이두승", "최병학", "이부경", "김태우", "정길영", "김완호"],
    25: ["한상훈", "이진욱", "조정모", "허세원", "박흥민", "김동규", "김명학", "윤백만", "유대식", "류승환", "김흥감", "여동철", "이상규"],
    27: ["엄주만", "여갑구", "소명환", "배진호", "정종훈", "허상철", "서태영", "김수준", "홍석일", "최민교", "김성화", "최덕화", "정영수", "김명섭", "김성구"],
    28: ["김종원", "정병근", "최운경", "조환제", "권우근", "강팔성", "박경근", "정인철", "김재현", "이병철", "백정호", "최위복", "홍재덕", "장방현"],
    29: ["성재우", "이국진", "박병국", "김우영", "신종국", "정배영", "성창호", "김상배", "박현충", "이상국", "김동선", "김상수", "박정효", "정기백"],
    30: ["홍한종", "장명", "한장완", "원유정", "박재천"],
    32: ["이헌동", "유영홍", "김형수", "이상호", "박상철", "정회성", "김진수", "서동호", "이재식", "정극재", "윤장국", "김상익", "김기봉", "이상윤", "김언태"],
    33: ["최성근", "이충일", "최동림", "서동석", "정규득", "김해민", "이장숙", "강재봉", "이장우", "이영선", "정평근", "이수진", "이학대", "배석재"],
    34: ["강봉옥", "최영길", "김경일", "김성제", "김성곤", "김경", "최종필", "양형규", "김민호", "이호철", "손유배", "송명준", "조완용", "김태환"],
    35: ["이영호", "박태신", "장동철", "도종삼", "차성환", "하인석", "한윤승", "김명호", "임철홍", "양대궁", "배재만", "김대영", "김한주"],
    37: ["전양탁", "강대근", "이광수", "김상석", "강성견", "윤병식", "김해철", "김현인", "이준호", "이광덕", "정병구", "김성배", "허진도", "전병두", "이일영"],
    38: ["나동천", "최세헌", "김치율", "임동수", "김병조", "김성룡", "이상윤", "조경제", "고명수", "이진우", "김헌", "김현덕", "정성임", "정성호"],
    39: ["강호영", "이헌영", "성기수", "김준일", "김중환", "정순정", "박명구", "박해운", "박효진", "박성규", "황수동", "조호동", "박주배", "주한건", "정홍태"],
    40: ["김창현", "이동건", "윤정두", "신재수", "유인재", "김홍률", "김동웅", "김대환", "오재근", "이재기", "조봉근", "최우택"],
    42: ["김해주", "박영기", "정선국", "유경원", "차순만", "이창호", "이봉건", "김영수", "권영진", "한윤성", "박희동", "정명재", "김천윤", "김민철"],
    43: ["김창범", "백민주", "배용수", "장명철", "최봉섭", "김성재", "염경호", "박창한", "김대강", "김사용", "정기호", "배차한", "장석우", "우명식"],
    44: ["이진길", "이창한", "강택용", "이강암", "배윤복", "김원수", "강창영", "장민정", "여상열", "박무언", "최현창", "김철규", "김경만", "이태만"],
    45: ["정우길", "정기철", "김봉조", "황성돈", "이용우", "이선환", "조영선", "송영도", "조인규", "남정로", "마평헌", "이정부", "주상실", "이귀영"],
    47: ["정종태", "조은석", "전적", "송준호", "권무현", "이해근", "박현희", "박용주", "김홍태", "김해종", "김용근", "주성일", "진장수", "정보영"],
    48: ["윤용주", "조민욱", "임종옥", "조병진", "문숭환", "성준제", "임수원", "김태경", "배홍섭", "강충현", "최상명", "최정헌", "이두영"],
    49: ["윤철호", "조병욱", "박근중", "조민형", "조진구", "강동우", "강신천", "조염", "김영인", "김성덕", "허은성", "이성호", "조동제", "오용철"],
    50: ["이종규", "오세영", "김병오", "김진광", "최창윤", "이웅기", "이상주", "문정관", "손경태", "김원주", "김진생", "전재수", "우명원", "정승환"],
    52: ["모창호", "박상걸", "허종석", "강두인", "오영진", "최홍식", "이상엽", "박강우", "박성욱", "현수홍", "김광식", "김일천", "공헌식", "전태영"],
    53: ["홍순봉", "김상헌", "서상주", "최수용", "정광기", "김경수", "박용수", "박시경", "문섭철", "김경렬", "정명진", "최창식", "이종구", "강홍구"],
    54: ["이성혼", "배성호", "이봉우", "구영철", "이동선", "김정호", "박만기", "이명호", "김성주", "김주담", "이찬우", "방진관", "문학준", "하명식"],
    55: ["김헌규", "심의욱", "김태완", "허원영", "박병호", "김일효", "임병천", "고광새", "김용덕", "손종규", "이용성", "나영균", "김욱현", "전영구"]
}


// const newData = {};
//
// data.split('\n').forEach(entry => {
//     const [index, name] = entry.split(':');
//     if (!newData[index]) {
//         newData[index] = [];
//     }
//     newData[index].push(name);
// });
//
// console.log(newData);
