import {ContentModel} from "../../model/ContentModel";
import {AlbumContent} from "../../model/ContentElement";
import AlbumMobile from "../../template/view/AlbumMobile";
import AlbumDesktop from "../../template/view/AlbumDesktop";

const FOLDER_NAME = "album41"
const IMAGE_COUNT = 57
const IMAGE_EXT = "jpg"
const indexData = {
    12:
        ["김문수", "박균제", "김영철", "문성철", "이병기", "권한근", "박춘우", "이태룡", "유동호", "박평규", "강이중", "홍수명", "이현근", "허해녕", "예상우", "이도욱", "정윤재", "강모세", "김종진", "정봉석", "김문수", "엄지섭", "박병주", "이해원", "안영삼", "장인기", "조재완", "정성봉", "유영상", "조주한", "이상도", "노환승", "서희찬", "최민호", "김훈", "권기현", "강동원", "이건국", "임경춘", "김진철", "김태완", "이수복", "사공대창", "이용호", "김민철", "김태진", "최창규", "은재수", "양광원", "정광호", "장영표", "이승열", "김철봉", "이재송", "안영호", "김상근", "손정덕", "전형준", "김원태", "송호열"],
    15:
        ["손영석", "이찬우", "천태경", "지대근", "양연호", "허용", "문재석", "정상호", "이인규", "최창호", "손동식", "서호율", "윤도경", "김기수", "김정태", "이한석", "조재천", "김철홍", "예춘홍", "김윤", "김경우", "김근배", "유동호", "김강완", "김세훈", "서민호", "박성호", "박재인", "윤병석", "빈영웅", "김후창", "정두석", "강도유", "박희현", "이상헌", "최경성", "도부민", "김정대", "김영철", "이기석", "황영규", "이동우", "하상호", "백상진", "이종학", "성창학", "양영기", "이윤오", "이광모", "이성희", "문병주", "이상인", "홍성무", "정인규", "이양재", "신성국"],
    19:
        ["김태산", "김강한", "강명춘", "이태균", "예인영", "이재용", "황수언", "김성칠", "박광일", "진창설", "박경원", "채성욱", "고봉진", "윤상수", "윤영태", "김대준", "장성진", "이광수", "권기태", "김종완", "이형석", "김한선", "장기원", "우용범", "김남용", "전병석", "김성완", "박용호", "임건호", "홍성권", "김종완", "김기덕", "강경모", "배재호", "김재식", "천무홍", "주영일", "김태우", "김태건", "박헌영", "곽수봉", "장윤석", "이영호", "오상열", "이영재", "정한경", "변수형", "김근태", "최철호", "곽철호", "김권한", "김언영", "정귀봉", "강성호", "조일석", "김인환", "심영수", "이철우", "조석호", "정진성", "곽수봉"],
    23:
        ["구준만", "배태영", "서욱태", "맹영준", "김상", "하용진", "이민", "박남주", "신석기", "정영기", "이동우", "윤준호", "김철호", "황상철", "박흥식", "정형섭", "김용석", "김태형", "김동희", "서선엽", "김홍권", "오송거봉", "하장헌", "천무진", "차정명", "안양호", "김환", "고두열", "최승묵", "최영호", "김성국", "우규헌", "김덕진", "주홍성", "김계현", "장우성", "최윤석", "김태영", "오용범", "주진국", "예종화", "김재영", "고용관", "박청식", "이용진", "이윤규", "이성건", "홍순두", "공호성", "여성철", "박노면", "이기호", "고형석", "김철규", "천경훈", "송수범", "최훈", "홍지명", "강병철", "고호성"],
    27:
        ["이충호", "이동훈", "정성권", "장원대", "김의웅", "박진호", "이태영", "이종민", "오광혁", "김병훈", "김정길", "안호일", "이승희", "강동훈", "홍명수", "신광식", "여상덕", "김국철", "박중섭", "김동호", "이창주", "권태수", "배윤철", "박선규", "최영인", "양형진", "신동확", "신우승", "이용환", "원용오", "원환희", "정원동", "정인수", "엄동기", "박용태", "이정학", "김원일", "김동명", "임채욱", "김영덕", "이영주", "한종필", "박영태", "김항남", "정상윤", "정송렬", "김찬용", "강명주", "김종찬", "김상룡", "주인곤", "정창원", "김영수", "박인수", "김동희", "김명호", "안창건", "황인일", "최종진", "김신현"],
    31:
        ["김복칠", "김진석", "김경래", "박성호", "강현수", "최상수", "심문식", "박영근", "문태영", "이창원", "이상천", "진종근", "김태근", "김희천", "정재성", "정동규", "박재현", "노생", "박종민", "문병일", "이재호", "김민성", "김무성", "송영민", "송윤호", "권명수", "김종천", "이근창", "김수호", "라현수", "신재식", "조호성", "조상덕", "백승준", "김상희", "사공욱", "홍완철", "정창남", "김광수", "고경천", "김만수", "정원주", "임영준", "이창훈", "김인수", "박흥식", "강호규", "정석현", "신운기", "김천현", "박명성", "김정년", "박수성", "남병로", "정전교", "노기현", "정용호", "김창태", "안광복"],
    35:
        ["김흥진", "하성엽", "이광수", "박성권", "이치안", "서희창", "신현룡", "조현욱", "최응한", "김민성", "방영석", "김진기", "김종옥", "최태선", "이정수", "정대길", "윤태우", "정수열", "박인규", "최연수", "허장기", "김용만", "황금산", "김영근", "권득용", "이종협", "김선종", "엄양기", "이광보", "신광호", "이민강", "김문출", "한정은", "이재현", "권도철", "김재희", "김태범", "김용해", "박기근", "이근대", "박광준", "오철호", "구좌관", "이대암", "강재성", "장세원", "양승렬", "윤치홍", "심재윤", "고영석", "손영태", "임규택", "정하정", "손병덕", "김성휘", "김기혁", "김동명", "남상철", "김동현", "임귀택"],
    39:
        ["전영조", "이하영", "양정석", "신영철", "최용우", "정용만", "우수곤", "윤순욱", "김석재", "엄홍섭", "민정기", "이동열", "권형순", "강훈", "문재건", "강춘식", "강성규", "김철완", "주진갑", "조성룡", "정상규", "김효준", "주재구", "배중기", "성낙상", "이동언", "이수근", "김원석", "김현철", "홍기제", "황두진", "최양일", "김희영", "이춘석", "윤병훈", "옥태준", "조득원", "하태완", "김문식", "양현호", "이갑조", "김덕식", "김재우", "곽경섭", "김동옥", "유상우", "박상원", "곽정택", "주원중", "양재영", "정윤석", "김성훈", "김태원", "김종규", "강상우", "이종숙", "김태형", "이재열", "김인조", "이성철"],
    43:
        ["구수만", "유동우", "주철우", "염경태", "이창하", "김인", "류수현", "박민수", "이갑춘", "신장원", "이광형", "윤성환", "김정수", "김학식", "최인락", "안성수", "김성휘", "곽명건", "김수완", "정성용", "김창좌", "진두권", "김범석", "이용환", "장재성", "김종기", "김정철", "남광우", "김택고", "고성일", "이만호", "이상도", "강병용", "전주병", "김윤영", "김진우", "문종대", "이창호", "김석영", "오향습", "김수형", "조영욱", "안종석", "박무열", "지용석", "변의석", "손동균", "김규태", "반영동", "김종열", "황선배", "김영주", "이주현", "김승종", "이재성", "신석윤", "이기한", "김부영"],
    47:
        ["윤태규", "류백열", "안광진", "양명호", "변광석", "선흥윤", "박성열", "김용태", "이상조", "노주석", "김유성", "장창민", "진기용", "조형곤", "송근성", "박광조", "김영식", "이상헌", "이상목", "심충섭", "김태형", "정훈", "구성회", "정윤용", "김동환", "김정헌", "송기영", "이명득", "손영상", "배남기", "방경일", "김무성", "배윤식", "김환석", "정복용", "성영민"]
}


export const album41Model = new ContentModel()
album41Model.add(new AlbumContent(FOLDER_NAME, IMAGE_COUNT, IMAGE_EXT))
album41Model.addIndexData("pageSearch", indexData)
album41Model.theme = AlbumDesktop;
album41Model.mobileTheme = AlbumMobile;
album41Model.setIsInclude("pageSearch", false);

// const dataArray = data.split('\n').filter(line => line.trim() !== '');
// const classData = {};
//
// let currentClass = '';
// dataArray.forEach(line => {
//     if (line.startsWith('[') && line.endsWith(']')) {
//         currentClass = line.substring(1, line.length - 1);
//         classData[currentClass] = [];
//     } else {
//         classData[currentClass].push(line);
//     }
// });
